from random import *
from random import randint

scade = input('სცადე ბედი! შეიყვანეთ ავტორი: ')
authors = {
   'კინგი': ['ის', 'კერი', 'ნათება'],
   'მურაკამი': ['ნორვეგიული ხე', '1Q84', 'ცეკვა, ცეკვა, ცეკვა'],
   'ჰემინგუეი': ['Მზეც ამოდის', 'გამარჯვებული არაფერს იღებს', 'აქვს და არ აქვს'],
   'ლონდონი': ['თეთრი ეშვი', 'წინაპართა ძახილი', 'მარტინ იდენი'],
   'როულინგი': ['ჰარი პოტერი ნაწილი 1', 'ფანტასტიკური მხეცები', 'ჰარი პოტერი ნაწილი 2'],
   'კრისტი': ['ათი პატარა ინდიელი', 'მკვლელობა აღმოსავლეთ ექსპრესში', 'სხეული ბიბლიოთეკაში'],
   'ფიცჯერალდი': ['სამოთხის ეს მხარე', 'დიდებული გეთსბი', 'ბოლო მაგნატი'],
   'ბრონტე': ['ჯეინ ეარი', 'მტკნარი სიმაღლეები', 'ვილეტ'],
   'ნესბო': ['თოვლის კაცი', 'თავებზე მონადირე', 'მოჩვენება'],
}
randnum= randint (0,2)

if scade in authors:
    wigni_list = authors[scade]
    print('რეკომდინებული წიგნი: ',wigni_list[randnum])
else:
    print('ავტორი ვერ მოიძებნა!')
